duxinglang-1/nRF9160_test/E2_TEST/src/screen/screen.c
	case SCREEN_ACTION_UPDATE:
		TempUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_TEMP].act = SCREEN_ACTION_NO;
}

void ExitTempScreen(void)
{
#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif
	MenuStopTemp();

	EnterIdleScreen();
}

void EnterTempScreen(void)
{
	if(screen_id == SCREEN_ID_TEMP)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_TEMP;
	scr_msg[SCREEN_ID_TEMP].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_TEMP].status = SCREEN_STATUS_CREATING;

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStopShow();
#endif
	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(3), NULL);

#ifdef CONFIG_SYNC_SUPPORT
	SetLeftKeyUpHandler(EnterSyncDataScreen);
#elif defined(CONFIG_FOTA_DOWNLOAD)
	SetLeftKeyUpHandler(fota_start);
#elif defined(CONFIG_DATA_DOWNLOAD_SUPPORT)
  #ifdef CONFIG_IMG_DATA_UPDATE
	SetLeftKeyUpHandler(dl_img_start);
	SetRightKeyUpHandler(dl_img_exit);
  #elif defined(CONFIG_FONT_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_font_start);
	SetRightKeyUpHandler(dl_font_exit);
  #elif defined(CONFIG_PPG_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_ppg_start);
	SetRightKeyUpHandler(dl_ppg_exit);
  #endif
#else
	SetLeftKeyUpHandler(EnterPoweroffScreen);
#endif

	SetRightKeyUpHandler(ExitTempScreen);
}
#endif/*CONFIG_TEMP_SUPPORT*/

#ifdef CONFIG_PPG_SUPPORT
void BPUpdateStatus(void)
{
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};
	unsigned char *img_anima[3] = {IMG_BP_ICON_ANI_1_ADDR,IMG_BP_ICON_ANI_2_ADDR,IMG_BP_ICON_ANI_3_ADDR};

#ifdef CONFIG_ANIMATION_SUPPORT
	if(PPGIsWorking())
		AnimaShow(BP_ICON_X, BP_ICON_X, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
	else
		AnimaStop();
#endif

	LCD_SetFontSize(FONT_SIZE_32);
	
	sprintf(tmpbuf, "%d/%d", g_bp_systolic, g_bp_diastolic);
	LCD_MeasureString(tmpbuf, &w, &h);
	x = BP_NUM_X+(BP_NUM_W-w)/2;
	y = BP_NUM_Y+(BP_NUM_H-h)/2;
	LCD_Fill(BP_NUM_X, BP_NUM_Y, BP_NUM_W, BP_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString(tmpbuf,&w,&h);
	x = BP_UP_NUM_X+(BP_UP_NUM_W-w)/2;
	y = BP_UP_NUM_Y+(BP_UP_NUM_H-h)/2;
	LCD_Fill(BP_UP_NUM_X, BP_UP_NUM_Y, BP_UP_NUM_W, BP_UP_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString(tmpbuf, &w, &h);
	x = BP_DOWN_NUM_X+(BP_DOWN_NUM_W-w)/2;
	y = BP_DOWN_NUM_Y+(BP_DOWN_NUM_H-h)/2;
	LCD_Fill(BP_DOWN_NUM_X, BP_DOWN_NUM_Y, BP_DOWN_NUM_W, BP_DOWN_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);
}

void BPShowStatus(void)
{
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};

	LCD_Clear(BLACK);
	
	LCD_ShowImg_From_Flash(BP_ICON_X, BP_ICON_Y, IMG_BP_ICON_ANI_2_ADDR);
	LCD_ShowImg_From_Flash(BP_BG_X, BP_BG_Y, IMG_BP_BG_ADDR);
	LCD_ShowImg_From_Flash(BP_UP_ARRAW_X, BP_UP_ARRAW_Y, IMG_BP_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(BP_DOWN_ARRAW_X, BP_DOWN_ARRAW_Y, IMG_BP_DOWN_ARRAW_ADDR);

	LCD_SetFontSize(FONT_SIZE_32);
	strcpy(tmpbuf, "0");
	LCD_MeasureString("0",&w,&h);
	x = BP_NUM_X+(BP_NUM_W-w)/2;
	y = BP_NUM_Y+(BP_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString("0",&w,&h);
	x = BP_UP_NUM_X+(BP_UP_NUM_W-w)/2;
	y = BP_UP_NUM_Y+(BP_UP_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString("0",&w,&h);
	x = BP_DOWN_NUM_X+(BP_DOWN_NUM_W-w)/2;
	y = BP_DOWN_NUM_Y+(BP_DOWN_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);
}

void BPScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_BP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_BP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_HR].status = SCREEN_STATUS_CREATED;
				
		BPShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		BPUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_BP].act = SCREEN_ACTION_NO;
}

void ExitBPScreen(void)
{
	k_timer_stop(&mainmenu_timer);

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif

	if(PPGIsWorking())
		MenuStopPPG();
		
	EnterIdleScreen();
}

void EnterBPScreen(void)
{
	if(screen_id == SCREEN_ID_BP)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_BP;	
	scr_msg[SCREEN_ID_BP].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_BP].status = SCREEN_STATUS_CREATING;

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif
	
	if(PPGIsWorking())
		MenuStopPPG();

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(3), NULL);

#ifdef CONFIG_TEMP_SUPPORT
	SetLeftKeyUpHandler(EnterTempScreen);
#elif defined(CONFIG_SYNC_SUPPORT)
	SetLeftKeyUpHandler(EnterSyncDataScreen);
#elif defined(CONFIG_FOTA_DOWNLOAD)
	SetLeftKeyUpHandler(fota_start);
#elif defined(CONFIG_DATA_DOWNLOAD_SUPPORT)
  #ifdef CONFIG_IMG_DATA_UPDATE
	SetLeftKeyUpHandler(dl_img_start);
	SetRightKeyUpHandler(dl_img_exit);
  #elif defined(CONFIG_FONT_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_font_start);
	SetRightKeyUpHandler(dl_font_exit);
  #elif defined(CONFIG_PPG_DATA_UPDATE)
	SetLeftKeyUpHandler(dl_ppg_start);
	SetRightKeyUpHandler(dl_ppg_exit);
  #endif
#else
	SetLeftKeyUpHandler(EnterPoweroffScreen);
#endif

	SetRightKeyUpHandler(ExitBPScreen);
}

void HRUpdateStatus(void)
{
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};
	unsigned char *img_anima[2] = {IMG_HR_ICON_ANI_1_ADDR, IMG_HR_ICON_ANI_2_ADDR};

#ifdef CONFIG_ANIMATION_SUPPORT
	if(PPGIsWorking())
		AnimaShow(HR_ICON_X, HR_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
	else
		AnimaStop();
#endif

	LCD_SetFontSize(FONT_SIZE_32);
	
	sprintf(tmpbuf, "%d", g_hr);
	LCD_MeasureString("0",&w,&h);
	x = HR_NUM_X+(HR_NUM_W-w)/2;
	y = HR_NUM_Y+(HR_NUM_H-h)/2;
	LCD_Fill(HR_NUM_X, HR_NUM_Y, HR_NUM_W, HR_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString("0",&w,&h);
	x = HR_UP_NUM_X+(HR_UP_NUM_W-w)/2;
	y = HR_UP_NUM_Y+(HR_UP_NUM_H-h)/2;
	LCD_Fill(HR_UP_NUM_X, HR_UP_NUM_Y, HR_UP_NUM_W, HR_UP_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);

	strcpy(tmpbuf, "0");
	LCD_MeasureString("0",&w,&h);
	x = HR_DOWN_NUM_X+(HR_DOWN_NUM_W-w)/2;
	y = HR_DOWN_NUM_Y+(HR_DOWN_NUM_H-h)/2;
	LCD_Fill(HR_DOWN_NUM_X, HR_DOWN_NUM_Y, HR_DOWN_NUM_W, HR_DOWN_NUM_H, BLACK);
	LCD_ShowString(x,y,tmpbuf);
}

void HRShowStatus(void)
{
	u16_t x,y,w,h;
	u8_t tmpbuf[64] = {0};

	LCD_Clear(BLACK);
	
